Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: སྟེན་གྲོགས་དེ་དག་དང་ལྷན་ཅིག་ཏུ་བཀུག་ཤུད་ཀྱིས་རྩེ་སྟེ། དེ་སྒྱུ་རྩལ་ཐམས་ཅད་ལ་བསླབས་པས། སྟེན་གྲོགས་དེ་དག་ལ་བསླབས་པ་ཐམས་ཅད་སྟོན་ཏོ། །
en: The boy would compete with his companions for sport and, having himself learned all the skills, he would impart all the points of training to his companions.

source: དེ་ནས་སྟེན་གྲོགས་གཅིག་གིས་ཡང་དག་པའི་ཚིག་གིས་སྐུལ་བར་བྱེད་དེ།
en: “One day a friend of his spoke the following words of admonishment:

source: གཞོན་ནུ་ཁྱོད་གཞན་དུ་འགྲོ་བའི་སྐྱོན་མི་ཤེས་སམ།
en: ‘My friend, are you not aware of the hazards of travel?

source: སྐྱེ་བོ་གཞན་གྱིས་ཕྱིར་རྒོལ་བར་མི་ཤེས་སམ།
en: Do you not recognize the danger of others attacking you?

source: ཡུལ་གཞན་དུ་འགྲོ་བའི་གཉེན་མ་ཡིན་པའི་སྐྱོན་མི་ཤེས་སམ།
en: Do you not know of the risks of travel without friends?

source: འབྲོག་གི་སྐྱོན་མི་ཤེས་སམ། ཆུའི་དགོན་པའི་སྐྱོན་མི་ཤེས་སམ། བཟའ་བ་དཀོན་པ་དང་། བཏུང་བ་དཀོན་པ་དང་།
en: Are you unaware of the hazards of villages, deserts, and dry and desolate places without food and drink?

source: སྐོམ་དཀོན་པའི་སྐྱོན་མི་ཤེས་སམ། མི་མཛའ་བའི་དགོན་པ་དང་། རྐུན་པོས་དཀྲུགས་པའི་སྐྱོན་མི་ཤེས་སམ། གཅན་གཟན་ཁྲོ་བས་དཀྲུགས་པའི་སྐྱོན་མི་ཤེས་སམ། ཆུས་དཀྲུགས་པ་དང་། རྒྱ་མཚོར་སོང་བའི་གྲུ་བོ་ཆེ་འཇིག་པའི་སྐྱོན་མི་ཤེས་སམ། སྲིན་མོས་འཇིགས་པ་དང་།
en: Do you not know the distress of being left without friends, of suffering from theft or the rage of wild animals, of floods or shipwreck, or of the terrors of demons?

source: གནོད་པ་ཐམས་ཅད་ལས་ཡོངས་སུ་གྲོལ་བ་མི་ཤེས་སམ།
en: Do you not know how one might escape harm?

source: གཞོན་ནུ་ཁྱོད་གཞན་གྱི་རྫས་ཀྱིས་ཡོངས་སུ་སྤྱོད་དམ།
en: My friend, are you partaking of things that belong to others?

source: བདག་གི་སྡུག་བསྔལ་གྱི་རྣམ་པ་དེ་ཉིད་མི་ཤེས་ཏེཆོས་མ་ཡིན་པས་བསླུས་སོ། །
en: Do you not recognize your own suffering, deceived by non-Dharma?

source: སྡུག་བསྔལ་གྱིས་བསྡུས་པའི་རྫས་ཡ་ང་བའི་རྫས་འདི་དག་མི་དགོངས་སམ་ཞེས་ཏེ།
en: Do you not understand how these things are nothing but suffering and terror?’

source: སྟེན་གྲོགས་དེས་ཡོངས་སུ་བསྐུལ་བར་གྱུར་ཏོ། །ཚིག་ཤིན་ཏུ་ཐོས་ནས།
en: “Voyager heard his friend’s admonishing words clearly and they caught his attention.

source: སེམས་པའི་རྗེས་སུ་ཞུགས་ཏེ་ཉེས་པ་དེ་དག་ཐམས་ཅད་སྙིང་ལ་བཞག་ནས་དེས་དེ་ལ་སྨྲས་པ།
en: Keeping in mind all the flaws that his friend had talked about, he then replied,

source: སྟེན་གྲོགས་བདག་ལ་བསྒོ་བ་ལེགས་སོ་ལེགས་སོ། །
en: ‘Friend, I understand this well, very well indeed.

source: ད་ལྟར་གྱི་ནོར་བསགས་པ་ནི་སྡུག་བསྔལ་བ་ཡིན་ཏེ།
en: All the wealth that we have was gathered from hardship.

source: སྟེན་གྲོགས་དེ་ལྟ་བས་ན་བདག་ཉིད་ཀྱི་ནོར་རྫས་ཡང་དག་པར་བསྡུ་བར་བྱའོ། །
en: My friend, I shall therefore go and make a fortune myself.’

source: དེས་ཕ་མ་དག་ལ་སྨྲས་པ།
en: “To his parents he said,

source: ཡབ་ཡུམ་ཚོང་ལ་མཆི་ཞིང་དེད་དཔོན་གྱི་བཟོ་ནུས་པར་བགྱིའོ། །
en: ‘Father and Mother, I shall now pursue business and become a successful captain.’

source: དེ་ནས་ཕ་མ་དག་གིས་སྨྲས་པ། གཞོན་ནུ་ཁྱོད་གཞན་དུ་འགྲོ་བར་མ་བྱེད་ཅིག །
en: “ ‘Young man,’ replied his parents, ‘do not journey anywhere.

source: བུ་གཞན་དུ་འགྲོ་བ་ལ་སྐྱོན་དཔག་ཏུ་མེད་པ་ཡོད་དོ། །
en: Son, traveling to other places is fraught with endless problems.

source: བདུན་བརྒྱུད་ཚུན་ཆད་ཀྱི་ཕུགས་ཀྱི་ནོར་རྫས་རབ་ཏུ་མང་པོ་དེ་དག་ཡོད་དེ།
en: We already have abundant wealth from the last seven generations.

source: འཁྲུལ་པ་མེད་པར་འདུག་གི །གང་དེ་དག་ལ་ཡོངས་སུ་སྤྱོད་ལ། ཁྱོད་ཀྱིས་གང་གཞན་དུ་འགྲོ་བར་བྱས་པ་མེད་པར་གྱིས་ཤིག །
en: In this there is no deception. Partake of this wealth and forget about journeying anywhere.

source: བུ་གཞན་དུ་འགྲོ་བ་དང་། ནོར་རྫས་ཡང་དག་པར་བསྡུ་བ་དེ་ལ་ཡང་སྡུག་བསྔལ་མང་བ་སྟེ།
en: Son, both traveling and gathering wealth involve much suffering.

source: གཞོན་ནུ་འདི་ནས་མ་འབྱུང་བར་ནོར་རྫས་ཀྱིས་ནོར་རྫས་ཀྱི་བྱ་བ་གྱིས་ཤིག །
en: Young man, do not leave but stay here and enjoy the wealth that we have.’

source: དེས་སྨྲས་པ། ཡབ་དེ་ལྟར་མ་ལགས་ཏེ།
en: “ ‘No, Father,’ replied the son.

source: ཡང་དག་པར་མ་གསུངས་སོ། །
en: ‘What you say is not right.

source: གལ་ཏེ་བདག་གི་བདུན་བརྒྱུད་ཀྱི་ཟུང་གིས་ནོར་རྫས་བཙལ་བ་དེ་ཅི་བུས་ཡོངས་སུ་མ་སྤྱད་དམ།
en: Well, the children of my ancestors seven generations ago did not partake of their parents’ wealth.

source: གང་དྲུག་པའི་ཟུང་གིས་བཙལ་བ་དེ་ཅི་བུས་ཡོངས་སུ་མ་སྤྱད་དམ།
en: The children of my ancestors six generations ago did not partake of their parents’ wealth.

source: གང་ལྔ་པའི་ཟུང་གིས་བསྒྲུབས་པ་དེ་ཅི་བུས་ཡོངས་སུ་མ་སྤྱད་དམ།
en: The children of my ancestors five generations ago did not partake of the wealth made by their parents.

source: གང་མེས་ཀྱི་ཡབ་ཀྱི་བར་གྱིས་བསྒྲུབས་པ་དེ་ཅི་མེས་ཀྱིས་ཡོངས་སུ་མ་སྤྱད་དམ།
en: My grandfather did not partake of my great-grandfather’s wealth.

source: གང་ཡབ་ཀྱི་ཡབ་ཀྱིས་བསྒྲུབས་པའི་ནོར་རྫས་དེ་ཅི་ཡབ་ཀྱིས་ཡོངས་སུ་མ་སྤྱད་དམ།
en: My father did not partake of my grandfather’s wealth.

source: དེ་བཞིན་དུ་བདག་ཀྱང་གཉེན་གྱིས་བསྒྲུབས་པའི་ནོར་རྫས་ཡོངས་སུ་སྤྱོད་པར་མི་སྤྲོའོ། །
en: Similarly, I do not wish to enjoy the wealth that my family members have created.’

source: དེ་ཕ་མའི་འདོད་པ་དག་མེད་ནསགྲུ་བོ་ཆེའི་ཚོང་བ་དང་སོང་སྟེ། དེ་རྒྱ་མཚོ་ཆེན་པོར་ཞུགས་པ་དང་། རླུང་གིས་གྲུ་བོ་ཆེ་རིན་པོ་ཆེའི་གླིང་དུ་ཕུལ་ཏོ། །
en: “Thus, against his parents’ wishes he set out on a great trade vessel. When the ship had reached the ocean, a wind rose that blew them to an island of jewels,

source: དེས་ནོར་བུ་རིན་པོ་ཆེ་རིན་ཐང་མེད་པ་སྣ་ཚོགས་དག་གིས་གྲུབ་བོ་ཆེ་བཀང་ངོ་། །
en: [and on that island Voyager] was able to fill his vessel with invaluable jewels of numerous kinds.

source: དེ་འགྲོ་བ་ཤིན་ཏུ་གྲུབ་ནས་ཕྱིར་ལོག་སྟེ།
en: Having thus accomplished the purpose of his journey he began his return home.

source: རྒྱ་མཚོ་ལས་དེ་རྒལ་ནས་རྒྱ་མཚོ་ལ་ཉེ་རེག་བྱས་པ་དང་། ནོར་བུ་རིན་པོ་ཆེ་ལག་པ་ལ་བཏགས་པ་རྒྱ་མཚོ་ཆེན་པོར་ལྷུང་ངོ་། །
en: Yet, when he was taking a bath in the sea on the way back, a precious jewel fell from his hand and was lost in the sea.

source: དེས་ནོར་བུ་རིན་པོ་ཆེ་དེ་ལྷུང་བ་ཙམ་ཉིད་ཀྱིས་ཆུ་ཕྱགས་ཐོགས་ཏེ། ནོར་བུ་རིན་པོ་ཆེའི་ཕྱིར་དེ་རིང་རྒྱ་མཚོ་འདི་བསྐམ་པར་བྱའོ་སྙམ་ནས། དེས་ཆུ་ཕྱགས་ཐོགས་ཏེ་རྒྱ་མཚོ་ཆེན་པོ་བསྐམ་པར་བརྩམས་པ་དང་།
en: As soon as the jewel had fallen, Voyager picked up a cloth and thought, ‘I shall dry up the sea and retrieve my jewel!’

source: དེས་ཆུ་ཕྱགས་བཟུང་མ་ཐག་ཏུ། ལྷ་བྱེ་བ་ཁྲག་ཁྲིག་སྟོང་ཕྲག་བརྒྱ་དག་གྲོགས་བྱེད་པར་གྲུབ་པར་གྱུར་ཏེརླུང་ཡང་གྲོགས་བྱེད་པར་གྱུར། མེ་ཡང་གྲོགས་བྱེད་པར་གྱུར་ཏོ། །
en: Immediately one hundred quintillion gods came to his assistance, and also the wind and fire served him.

source: དེ་ནས་ཆུ་ཕྱགས་ཀྱིས་ཆུ་ཕྱགས་མ་ཐག་ཏུ། རླུང་གིས་ནི་སྐེམས། མེས་ནི་སྲེག་གོ། །
en: Thus, as soon as he had soaked up some water with his cloth, the wind would dry it and the fire would scorch it.

source: དེ་ནས་རྒྱ་མཚོའི་ལྷ་དེ་དག་གིས་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: The gods of the sea then spoke this verse:

source: རྒྱ་མཚོ་འདི་ནི་མཐའ་ཡས་མི་ཟད་དེ། །ཆུང་ཟད་འགྱུར་གྱི་རྒྱ་མཚོ་དེ་ལྟ་མིན། །
en: “ ‘This ocean is infinite and inexhaustible— Not the kind of sea that can run dry.

source: གྲོགས་པོ་མཁའ་ལ་ལམ་གྱི་ཚད་འདོད་ལྟར། །རྒྱ་མཚོ་བསྐམ་པ་དག་ཏུ་ཇི་ལྟར་ནུས། །
en: Friend, like wanting to measure the extent of space, How could you possibly dry up the sea?’

source: དེས་ལྷ་དེ་དག་ལ་ཚིགས་སུ་བཅད་དེ་སླར་སྨྲས་པ། །
en: “Voyager replied to the gods with these verses:

source: ལྷ་དག་རྒྱ་མཚོ་མཐའ་ཡས་མ་ཡིན་ཏེ། །རྒྱ་མཚོ་དཔག་ཚད་མཐའ་ཡས་དཔག་ཏུ་རྙེད། །
en: “ ‘Gods, the ocean is not infinite— The infinite leagues of the sea can be measured.

source: བདག་གིས་བརྩོན་འགྲུས་མཐའ་ཡས་དཔག་མེད་དེ། །རྒྱ་མཚོ་ཆེན་པོ་བདག་གིས་བསྐམ་པར་ནུས། །
en: My infinite diligence, however, cannot be measured— I can dry up this ocean.

source: རྒྱ་མཚོའི་ལྷ་དག་བདག་གི་སྟོབས་ལ་ལྟོས། །མཁའ་ལ་ལྷ་ཡིས་རབ་ཏུ་གང་བ་ལྟོས། །
en: “ ‘Gods of the sea, behold my power— See how divine beings fill the sky.

source: དཔག་མེད་ལྷ་དག་བདག་གི་གྲོགས་ཡིན་ཏེ། །འབར་དང་སྲེག་དང་དེ་བཞིན་རླུང་དུ་བྱེད། །
en: These gods beyond counting are all my helpers, Who burn, blaze, and fan.

source: བདག་གིས་མཁའ་ལ་ཆུ་གཏོར་བ་དག་ལྟོས། །ནམ་མཁའ་དེར་ནི་འགྲོ་བ་མེད་པ་ལྟོས། །
en: “ ‘Watch how I throw water up into the sky And how the water does not return.

source: ལྷ་ཚོགས་དག་ནི་བདག་གི་གྲོགས་འགྱུར་ཏེ། །བར་སྣང་ཆུ་ནི་སྲེག་ཅིང་སྐེམས་པར་བྱེད། །
en: The host of deities are my helpers, Causing the water to dry up and evaporate in midair.

source: བར་སྣང་རླུང་ནི་བདག་གི་གྲོགས་ཡིན་ཏེ། །རྒྱ་མཚོ་བསྐམ་པ་དག་ལ་ཞུམ་པ་མེད། །
en: “ ‘The wind in the sky is my friend— I have no qualms about drying up the ocean.

source: རྒྱ་མཚོས་བདག་གི་ནོར་བུ་མ་བཏང་ན། །བདག་ལ་ཡོན་གནས་སྟོབས་དང་ལྡན་པ་སྟེ། །
en: Should the sea not release my jewel My objects of worship are of great power.

source: བདག་གི་ཡོན་གནས་སངས་རྒྱས་དཀོན་མཆོག་དང་། །དེ་བཞིན་སྤྲོས་མེད་ངེས་པར་འབྱུང་བའི་ཆོས། །འདྲེན་པའི་སྲས་དེ་དགེ་འདུན་རིན་ཆེན་ཡོད། །
en: “ ‘The ones I worship are the precious Buddha, The unconstructed Dharma that frees, And the guiding heirs, the precious Saṅgha.

source: དེ་དག་བདག་གིར་འགྱུར་ཏེ་མཚོ་ལྷའི་མིན། །
en: They are my objects of worship, not those of the gods of the sea.’

source: སྐྱེས་བུ་ཁྱོད་ཀྱི་ཚིག་ནི་ངེས་པ་སྟེ། །དེ་བཞིན་བརྩོན་སྟོབས་ཁྱོད་དང་ལྡན་པ་ལེགས། །
en: “ ‘Sir, your words are definitive And your power of diligence excellent.

source: ནོར་བུ་དང་ནི་ལྡན་པར་འགྱུར་ཏེ་སྦྱིན། །དེ་རིང་དཀོན་མཆོག་གསུམ་ལ་འབུལ་བར་གྱིས། །
en: You shall be given your jewel— Offer it today to the Three Jewels!’

source: མཽད་གལ་གྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་དེའི་དུས་ན་དེད་དཔོན་སློང་ལྡན་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན། ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Maudgalyāyana, in case you may think that at that time the captain Voyager was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་དེད་དཔོན་གྱི་བུ་སློང་ལྡན་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was the captain Voyager.

source: མཽད་གལ་གྱི་བུ་ལེ་ལོ་མེད་ཅིང་བརྩོན་འགྲུས་བརྩམས་པའི་བྱང་ཆུབ་སེམས་དཔས་ནི་བདུད་ལྔ་ལས་རྒྱལ་བར་ནུས་སོ། །
en: Maudgalyāyana, a bodhisattva who musters diligence free from laziness will be victorious over five māras.

source: ལྔ་གང་ཞེ་ན་འདི་ལྟ་སྟེ། ཉོན་མོངས་པའི་བདུད་དང་། ཕུང་པོའི་བདུད་དང་། ལས་ཀྱི་བདུད་དང་། འཆི་བདག་གི་བདུད་དང་། ལྷའི་བུའི་བདུད་དོ། །
en: Which are the five? They are the māras of the afflictions, the aggregates, karma, the Lord of Death, and the divine child.

source: མཽད་གལ་གྱི་བུ་ངས་བརྩོན་འགྲུས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པར་བྱ་བའི་དོན་དུ། སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་དགེ་བའི་རྩ་བ་སྣ་ཚོགས་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created boundless roots of virtue in order to understand the origin as related to the knowledge of diligence.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས།
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a king known as Subhaga.

source: དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་རྒྱལ་པོ་གྲགས་བཟང་ཞེས་བྱ་བ་ཆོས་ཀྱི་རྒྱལ་པོ་ཆོས་དང་ལྡན་པ་ཚེ་རིང་བ། རིང་དུ་འཚོ་བ་རིན་པོ་ཆེ་སྣ་བདུན་དང་ལྡན་པ། མིའི་འབྱོར་པ་བཞི་དང་ལྡན་པ།
en: He was a religious and righteous king with an extensive lifespan. Living for a long time, he possessed the seven precious substances and the fourfold human wealth.

source: བུད་མེད་འབུམ་ཕྲག་དྲུག་གི་བདག་པོ། སྐྱེ་བོའི་བསམ་པ་ཐམས་ཅད་ལ་དབང་སྒྱུར་བ།
en: He was the lord of six hundred thousand ladies and ruled over the minds of his subjects.

source: དེ་བཞིན་གཤེགས་པ་དཔག་ཏུ་མེད་པ་དག་ལ་རིམ་གྲོ་བྱས་པ། དགེ་བའི་རྩ་བ་བསགས་པ་དཔག་ཏུ་མེད་པ་དང་ལྡན་པ། སངས་རྒྱས་ཁྲི་ཕྲག་དཔག་ཏུ་མེད་པ་དག་ལ་དགེ་བའི་རྩ་བ་བསྐྱེད་པ་དང་ལྡན་པ་ཞིག་བྱུང་ངོ་། །
en: He had served boundless thus-gone ones, was endowed with boundless stores of roots of virtue, and had created roots of virtue before a boundless number of tens of thousands of buddhas.

source: དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་མཐའ་ཡས་ཞེས་བྱ་བ་ནས།
en: “At that time there appeared in the world a thus-gone one named Anantaraśmin;

source: དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་མཐའ་ཡས་དེའི་འཁོར་ཉན་ཐོས་དགྲ་བཅོམ་པ་ཟག་པ་ཟད་པ། ཉོན་མོངས་པ་མེད་པ། དབང་དང་ལྡན་པར་གྱུར་པ་ནས་དེ་བཞིན་དུ་སྦྱར་ཏེ། ཡང་དག་པའི་ཤེས་པས་རྣམ་པར་གྲོལ་བར་བྱེད་པ་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་སྟོང་བརྒྱད་ཅུ་བྱུང་ངོ་། །
en: Within the retinue of the thus-gone Anantaraśmin were eighty quintillion hearers. All were worthy ones whose defilements were exhausted, who were free of afflictions, controlled, and who had obtained supreme perfection in mastering all mental states.

source: དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་མཐའ་ཡས་དེའི་སྐུ་ཚེའི་ཚད་དཔག་ཏུ་མེད་པར་གྱུར་ཏོ། །
en: The thus-gone Anantaraśmin was also endowed with an immeasurable life-span.

source: དེའི་ཚེ་རྒྱལ་པོ་གྲགས་བཟང་དེའི་ཡུལ་རྣམ་པར་རྒྱལ་བྱེད་དེ་ནས་སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་དགུ་བཅུ་རྩ་དགུ་དག་དེ་བཞིན་གཤེགས་པ་དེའི་དྲུང་དུ་སྐྲ་དང་ཁ་སྤུ་བྲེགས་ནསགོས་ངུར་སྨྲིག་བགོས་ཏེ། ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་བྱུང་ངོ་། །
en: “In the realm ruled by King Subhaga there were ninety-nine quadrillion beings who before the thus-gone Anantaraśmin had shaved their hair and beard, donned the saffron colored robes, and left their homes to become homeless renunciants.

source: དེ་དག་ཐམས་ཅད་བདེ་བ་སྐྱེས་པར་ནི་གྱུར་ན། དེ་དག་ལེ་ལོ་མེད་པ་ཡང་རྙིད་པར་གྱུར་ཏོ། །
en: All of them were happy and free from laziness.

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་མཐའ་ཡས་ཏེ་སྔོན་གྱི་དགེ་སློང་གི་དགེ་འདུན་དེ་དག་དང་ཐབས་ཅིག་ཏུ་དགེ་སློང་དེ་དག་ག་ལ་བ་དེར་གཤེགས་ཏེ་ཕྱིན་ནས།
en: Once the thus-gone Anantaraśmin traveled accompanied by his senior monks to the place where the other monks were residing.

source: དགེ་སློང་གི་དགེ་འདུན་དེ་དག་གི་དབུས་སུ་བཞུགས་ཏེ།
en: He entered into the center of their assembly,

source: དེའི་ཚེ་བརྩོན་འགྲུས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དང་ཡང་དག་པར་རབ་ཏུ་ལྡན་པའི་གཏམ་འདི་ལྟ་བུ་འདི་དག་མཛད་དོ། །
en: and there spoke the following words on the knowledge of the origin as related to knowledge of diligence:

source: གང་ཟག་ཐེག་པ་བདེ་བས་བརྩོན་འགྲུས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་སྒྲུབ་པར་འདོད་པས་ལམ་བར་མས་རྟོགས་པར་བྱ་སྟེ།
en: “ ‘Those wishing to accomplish knowledge of the origin as related to knowledge of diligence by means of a delightful vehicle must gain realization through the middle path.

source: འདི་ལྟ་སྟེ། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དུས་དང་དུས་མ་ཡིན་པར་བསྒོམ་པ་ལ་ཞུམ་པ་མེད་པའི་བརྩོན་འགྲུས་ཀྱིས་བརྩོན་འགྲུས་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་བསྒོམ་པར་བྱའོ། །
en: That is to say, they must ardently cultivate the aspects of awakening with undaunted diligence at all times and occasions.

source: ཆོས་རྣམ་པར་འབྱེད་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་བསྒོམ་པར་བྱ།
en: They must cultivate the aspect of awakening

source: ཆོས་རྣམ་པར་འབྱེད་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་བཏང་སྙོམས་སུ་བྱ།
en: that discerns phenomena and become poised within that.

source: དགའ་བ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་བསྒོམ་པར་བྱ།
en: They must cultivate the joy that is an aspect of awakening.

source: ཏིང་ངེ་འཛིན་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་ལ་བཏང་སྙོམས་སུ་བྱ་སྟེ།
en: They must become poised within the absorption that is an aspect of awakening.

source: དེ་ཡང་དྲན་པས་བརྟག་པར་བྱའོ། །
en: They must examine things with mindfulness.

source: སེམས་ཅན་རྣམས་ལ་བདེ་བར་སེམས་པ་དེ་ཡང་ཟས་ཞིམ་པོ་བཟའ་བ་དང་ལྡན་པ་དང་། གནས་མལ་བདེ་བར་འདུག་པ་དང་། ལུས་གྱ་ནོམ་པ་སླ་བར་འགྱུར་རོ། །
en: Wishing sentient beings happiness, they will easily find good food, a pleasant dwelling, and an excellent body.

source: བརྩོན་འགྲུས་ཀྱི་སྤྱད་པ་རྩོམ་པས་སྡུག་བསྔལ་དང་བྲལ་ཞིང་།
en: Practicing with diligence, they will become free from suffering.

source: ཤེས་པ་བར་མ་དེས་བདེ་བར་ངེས་པར་འབྱུང་ངོ་། །
en: Through such a balanced mind they will certainly find happiness.’

source: དེའི་ཚེ་རྒྱལ་པོ་གྲགས་བཟང་དེ་ཆོས་བཤད་པ་དེ་དག་ལ་གུས་པར་བྱས་ཤིང་ཐོས་ལ་བརྩོན་འགྲུས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་རྟོགས་པས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་བོ། །
en: “King Subhaga listened to this Dharma discourse and received it with great respect. Realizing the knowledge of the origin as related to knowledge of diligence, he gained acceptance that phenomena are unborn.

source: མཽད་གལ་གྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་གྲགས་བཟང་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན། ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: Maudgalyāyana, in case you may think that at that time King Subhaga was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་གྲགས་བཟང་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was that king, Subhaga.”

source: ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: At this point Mahā­maudgalyāyana addressed the Blessed One:

source: བཅོམ་ལྡན་འདས་བདག་ཅག་གིས་འདི་ལྟར་འཚལ་ཏེ།
en: “Blessed One, we are pondering the statement,

source: གང་གི་ཚེ་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་ཀྱིས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་བོ། །
en: ‘At this time the thus-gone Dīpaṃkara gained acceptance that phenomena are unborn.’

source: ཞེས་བཤད་པ་འདིའི་དོན་ཇི་ལྟར་བལྟ་བར་བགྱི།
en: How are we to regard this statement?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། མཽད་གལ་གྱི་བུ་གང་ཟག་གི་དབང་གིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དག་ཆོས་སྟོན་པ་གོ་བར་མཛད་དོ། །
en: “Maudgalyāyana,” replied the Blessed One, “the blessed buddhas convey the Dharma in relation to people.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་བརྩོན་འགྲུས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་བསྒྲུབ་པར་འདོད་པས་བརྩོན་འགྲུས་མཉམ་པ་ཉིད་ལ་མངོན་པར་བརྩོན་པར་བྱ་ཞིང་རྟོགས་པར་བྱ།
en: Maudgalyāyana, bodhisattvas who wish to accomplish knowledge of the origin as related to knowledge of diligence must therefore persevere in and realize the sameness of diligence.

source: བརྩོན་འགྲུས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ལ་ཆོས་སོ་སོར་བགེད་པ་དང་། ཟང་ཟིང་སོ་སོར་བགེད་པར་ཡང་བྱའོ། །
en: In the context of knowledge of the origin as related to knowledge of diligence one must share the Dharma as well as material things.

source: མཽད་གལ་གྱི་བུ་ངས་བརྩོན་འགྲུས་ཤེས་པ་འགོག་པ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་བདག་སེམས་ཅན་རྣམས་ལ་ཕན་པར་བྱ་བའི་ཕྱིར་བརྩོན་འགྲུས་ཤེས་པ་འགོག་པ་ཤེས་པ་ཇི་ལྟར་ཐོབ་པར་བྱ་སྙམ་ནས་དགེ་བའི་རྩ་བ་སྣ་ཚོགས་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created boundless roots of virtue in order to understand the origin as related to knowledge of diligence. I did this by wondering how I could gain knowledge of the origin as related to knowledge of diligence for the sake of all sentient beings.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ནས། དེ་བཞིན་དུ་སྦྱར་ཏེ། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་དེ་བཞིན་གཤེགས་པ་བདུད་དད་པ་ཞེས་བྱ་བ་ནས།
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past, there appeared in the world a thus-gone one named Māra Faith;

source: དེ་བཞིན་གཤེགས་པ་བདུད་དད་པ་དེའི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་བདུད་ཤུགས་འཆང་ཞེས་བྱ་བ་བྱུང་སྟེ། དེས་སངས་རྒྱས་ལྔ་བརྒྱ་དག་གི་གསུང་རབ་ལ་བདུད་ཀྱི་ལས་བྱས་སོ། །
en: Within the buddha realm of the thus-gone Māra Faith there was a māra known as Vegadharin, who had carried out māra activities against the teachings of five hundred buddhas.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་ལ་སྲིད་པའི་འགྲོ་བར་འཆི་བ་དང་། སྐྱེ་བ་དེ་དང་དེ་དག་ཏུ་མདུད་པར་འཛིན་པ་རྗེས་སུ་དྲན་ཏེ།
en: He had developed malice by remembering how those thus-gone ones had lived and died within existence, [and so he engaged in māra activity in relation to both their presence and passing into nirvāṇa.]

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་བཞུགས་པ་དང་། ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་དེ་དག་ལ་བདུད་ཀྱི་ལས་རྣམས་བྱས་སོ། །
en: [He had developed malice by remembering how those thus-gone ones had lived and died within existence,] and so he engaged in māra activity in relation to both their presence and passing into nirvāṇa.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་དང་། དེ་བཞིན་གཤེགས་པའི་ཉན་ཐོས་དེ་དག་དང་། དེ་བཞིན་གཤེགས་པ་སོ་སོའི་གསུང་རབ་ལ་བར་ཆད་བྱས་པས་བསྐལ་པ་གྲངས་མེད་པར་ལོག་པར་ལྟུང་ངོ་། །
en: Creating obstacles for those thus-gone ones, their hearers, as well as their teachings, he had fallen into error for incalculable eons.

source: དེ་དེ་བཞིན་གཤེགས་པ་བདུད་དད་པ་དེ་བྱང་ཆུབ་མངོན་པར་འཚང་རྒྱ་བར་བཞེད་པའི་དེ་བཞིན་གཤེགས་པ་དེའི་གསུང་རབ་ལ་ཡང་བར་ཆད་བྱ་བར་འདོད་དོ། །
en: “When the thus-gone Māra Faith was about to assert his awakening to perfect buddhahood, the māra Vegadharin wanted to bring obstacles to his teaching.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་བདུད་དད་པ་དེ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་བཞུགས་པ་དང་། བདུད་ཤུགས་འཆང་དེ་སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་ནོ། །
en: Yet as the bodhisattva Māra Faith sat at the seat of awakening he recollected the māra Vegadharin’s previous existences.

source: དེ་བདུད་ཤུགས་འཆང་དེའི་དགེ་བའི་རྩ་བ་དེ་དག་གཟིགས་ནས་ཇི་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་མཛད་པ་མངོན་པར་འདུ་མཛད་དེ། དེ་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་མཛད་པ་མངོན་པར་འདུ་མཛད་པས་བདུད་ཤུགས་འཆང་སྔོན་གྱི་དེ་བཞིན་གཤེགས་པ་དེ་དག་ལ་མདུད་པར་བཟུང་བ་རྗེས་སུ་དྲན་ཏེ། གང་སེམས་ཅན་དམྱལ་བ་ཆེན་པོར་སྐྱེས་པ་དེ་དག་རྗེས་སུ་དྲན།
en: Perceiving his roots of virtue, he now performed a miraculous act whereby the māra Vegadharin came to recollect how he had harbored malice against the thus-gone ones in the past, and how sentient beings had thus fallen into the great hells.

source: གང་སེམས་ཅན་དམྱལ་བ་ཆེན་པོའི་རྒྱུར་གྱུར་པ་དེ་དག་རྗེས་སུ་དྲན་ནས། དེ་འཇིགས་སྐྲག་སྟེ། སྤུ་ཟིང་ཞེས་བྱེད་ནས།
en: Terrified, he remembered the causes of the great hells and his hair stood on end.

source: སྐྱོ་བ་ཐོབ་བོ། །སྐྱོ་བ་ཐོབ་པས་བྱང་ཆུབ་སེམས་དཔའ་དེ་ལ་སེམས་རབ་ཏུ་དང་བའི་དད་པ་ཐོབ་ནས།
en: He then became sad, and thereby also gained pure faith in the bodhisattva.

source: བྱང་ཆུབ་སེམས་དཔའ་བདུད་དད་པ་དེ་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: He then spoke the following verses to the bodhisattva Māra Faith:

source: ཤེས་རབ་ཆེན་པོ་ཡེ་ཤེས་དཔག་མེད་མངའ་བ་ཕན་མཛད་ཐུགས་རྗེ་ཅན། །འཇིག་རྟེན་ཀུན་ལ་ཕན་པ་མཛད་པ་བདེ་གཤེགས་ཁྱོད་ལ་སྐྱབས་སུ་མཆི། །
en: “ ‘Compassionate benefactor of great insight and boundless wisdom, I take refuge in you, Thus-Gone One, who brings benefit to the entire world.

source: ཇི་ལྟར་རལ་གྲི་གཟེབ་ལ་མི་མཆིས་སྐད་ཅིག་གྱེན་དུ་འཕར་ལྟར་བདག །
en: I am like a man who for an instant manages to leap above a forest of razors.

source: དེ་ལྟར་རྒྱལ་པོ་ཁྱོད་ལ་དད་མ་བགྱིས་པས་སེམས་ཅན་སྡུག་བསྔལ་མྱོང་། །
en: Sentient beings suffer because of their lack of faith in you, King.

source: ཇི་ལྟར་མི་དག་མདའ་མདུང་མདའ་བོ་ཆེས་བརྒྱ་བ་སྡུག་བསྔལ་ཚོར་འགྱུར་ལྟར། །ཁྱོད་ལྟ་ཡིད་ཀྱིས་སྡང་བ་སེམས་ཅན་དམྱལ་བར་མཆི་ཞིང་སྡུག་བསྔལ་མྱོང་། །
en: “ ‘As when people feel the pain of being struck by arrows, spears, and lances, Beings now suffer in the hells because of their anger at you.

source: ཇི་ལྟར་མི་དག་ཆས་ནས་རི་བོའི་རྩེར་སོང་ལྷུང་བ་ལུས་སྡུག་བསྔལ། །ལྷུང་བས་བརྒྱབ་ཅིང་ཕྱེར་བླགས་ལུས་ནི་སྐད་ཅིག་ཙམ་ཡང་བདེ་མི་འཐོབ། །
en: Those who reach a mountain summit and then fall from it are tormented, Without even an instant of joy, as their bodies are beaten and broken to pieces.

source: དེ་བཞིན་སྟོབས་བཅུ་ཁྱོད་ལ་ཡིད་ཀྱིས་སྣང་བའི་ལུས་ཀྱང་ཕྱེ་མར་འགྱུར། །
en: “ ‘Likewise, being angry at you, lord of the ten powers, their bodies are crushed.

source: ཇི་ལྟར་མི་དག་རལ་གྲི་དགྲ་སྟས་བརྒྱབ་ལྟར་སྲིད་འགྲོར་བདེ་མི་འཐོབ། །རྒྱལ་ལ་ཡིད་སྡང་སྲིད་འགྲོར་བདེ་བ་ཅུང་ཟད་ཙམ་ཡང་ཐོབ་པ་མེད། །
en: Just as there can be no pleasure when one is struck by the enemy’s sword, Those who harbor anger at the victorious ones will know no happiness.

source: དེ་ལྟ་བས་ན་བདེ་གཤེགས་ཁྱོད་ལ་ཡིད་ནི་ཤིན་ཏུ་མངོན་དད་བགྱི། །
en: So, let us develop great faith in you, O Blissful One.

source: མཆོག་སྦྱིན་ཁྱོད་ལ་སྐྱབས་སུ་མཆི་ཞིང་བདག་ནི་མི་དགེའི་ལས་མཐོལ་ལོ། །
en: “ ‘Supreme benefactor, in you I take refuge and confess my unvirtuous deeds.

source: རྒྱལ་བ་སྟོབས་བཅུ་མངའ་བར་བདག་འགྱུར་དེ་རིང་སྨོན་ལམ་བརྟན་པར་འདེབས། །
en: Victor, today I fervently pray to master the ten powers.

source: འགྲོ་བ་དཔག་མེད་སྲིད་པའི་འགྲོ་བར་མི་བདེ་སྡུག་བསྔལ་མང་པོ་མྱོང་། །
en: Innumerable beings are unhappy and suffer within infinite existence.

source: སྟོབས་བཅུའི་སྟོབས་དག་རབ་ཏུ་ཐོབ་ནས་བདུད་ཀྱི་སྟོབས་ནི་སྟོབས་མེད་བགྱི། །
en: I shall achieve the ten powers and render the power of the māras powerless.

source: རྒྱལ་ལ་བདག་ནི་ཡིད་གཉིས་རྡུལ་ཙམ་མ་མཆིས་བདེ་བར་གཤེགས་པའི་བློ་ལ་འཇུག །
en: “ ‘Without any doubt about the victors, I now pursue the blissful ones’ mind.

source: རྒྱལ་བ་འགྲོ་གཙོ་སྟོབས་མཆོག་སྟོབས་མངའ་དཔག་ཏུ་མེད་པར་བདག་འགྱུར་བགྱི། །
en: I will become a victor, a leader endowed with boundless and supreme powers.

source: བདེ་གཤེགས་སྟོབས་བཅུ་སྟོབས་མཆོག་ཁྱོད་ལ་མི་ཡི་ཚོགས་དག་སྐྱབས་སུ་མཆི། །
en: Blissful master of the ten powers, the hosts of beings take refuge in you.

source: སྲིད་པ་སྤངས་ཤིང་རྣམ་སྲིད་ཟད་ནས་བདག་ཀྱང་འགྲོ་བའི་རྒྱལ་བར་བགྱི། །
en: As I abandon existence and bring it to an end, I too shall become a world conqueror!’
